#include <stdio.h>


/**
企业发放的奖金根据利润提成。

利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成。
从键盘输入当月利润I，求应发放奖金总数？
*/

int main1() {
    printf("输入企业利润值:");
    int money;
    scanf("%d", &money);

    float result = 0;
    if (money <= 100000) {
        result = money * 0.1;
    } else if (money <= 200000) {
        result = 100000 * 0.1 + (money - 100000) * 0.075;
    } else if (money <= 400000) {
        result = 100000 * 0.1 + (200000 - 100000) * 0.075 + (money - 200000) * 0.05;
    } else if (money <= 600000) {
        result = 100000 * 0.1 + (200000 - 100000) * 0.075 + (400000 - 200000) * 0.05 + (money - 400000) * 0.03;
    } else if (money <= 1000000) {
        result = 100000 * 0.1 + (200000 - 100000) * 0.075 + (400000 - 200000) * 0.05 + (600000 - 400000) * 0.03 +
                 (money - 600000) * 0.015;
    } else if (money > 1000000) {
        result = 100000 * 0.1 + (200000 - 100000) * 0.075 + (400000 - 200000) * 0.05 + (600000 - 400000) * 0.03 +
                 (1000000 - 600000) * 0.015 + (money - 1000000) * 0.01;
    }
    printf("今年利润为%d 提成为%.2f", money, result);

    return 0;

}